-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 11, 2023 at 10:01 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `smartcart`
--

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `merchants`
--

CREATE TABLE `merchants` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `city` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `mobile` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `merchants`
--

INSERT INTO `merchants` (`id`, `city`, `name`, `email`, `mobile`, `created_at`, `updated_at`) VALUES
(1, 'aqaba', 'albustangy', 'aqaba@gmail.com', '0790369540', NULL, NULL),
(2, 'amaan', 'alzaeem', 'aqaba@gmail.com', '0790369540', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2023_04_10_121104_create_merchants_table', 1),
(6, '2023_04_10_121657_create_products_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_number` varchar(255) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_descount` decimal(8,0) NOT NULL,
  `merchant_id` bigint(20) UNSIGNED NOT NULL,
  `price` decimal(8,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `product_number`, `product_name`, `product_descount`, `merchant_id`, `price`, `created_at`, `updated_at`) VALUES
(5905, '6291003084676', 'بسكوت بريك ديلايتس 16.5غ', '0', 1, '222.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5906, '6253003180277', 'عصير حموده 1لت عده نكهات', '0', 1, '122.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5907, '6281007032582', 'حليب المراعى فراوله 200مل', '0', 1, '333.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5908, '6281033409020', 'سوبر رول امريكانا كيك', '0', 1, '0.30', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5909, '6253002477644', 'فطيره عائلى', '0', 1, '0.35', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5910, '6281036247308', 'شيبس شيتوس كبير', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5911, '6253342504291', 'عصير طيبه235مل نكهات', '0', 1, '0.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5912, '40111216', 'شوكولاته باونتي57غ', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5913, '6253003120068', 'لبن حموده شراب', '0', 1, '0.15', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5914, '62501934', 'دخان ماستر سلم عدة نكهات', '0', 1, '1.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5915, '6251059302209', 'جولدن صابون سائل جلى 1لتر', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5916, '6', 'جلي 150فلس', '0', 1, '0.15', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5917, '6281007035392', 'جبنه مراعي مثلثات 24قطع', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5918, '46123367', 'سكتلز فواكه صغير', '0', 1, '0.10', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5919, '6281007042345', 'حليب المراعي خالى الدسم 1لتر', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5920, '6223000493922', 'مولتو مينى', '0', 1, '0.30', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5921, '6281036564207', 'شيبس دوريتوس 40غ', '0', 1, '0.30', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5922, '1401318', 'مقص ستانلس ويكو', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5923, '89686120714', 'اندومى شعريه مقليه', '0', 1, '0.20', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5924, '4084500442931', 'اريال 5كغم', '0', 1, '8.00', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5925, '757349228830', 'كاتشب امريكانا جورميت340غ', '0', 1, '0.60', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5926, '8691707036694', 'كريمه تيوب', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5927, '5029053535746', 'فوط نسائيه كوتكس الترا سوبر بلس 8فوط', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5928, '6253002444394', 'سويس رول كريمه', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5929, '6223003806071', 'بسكويت اوبكر بيسكريم20غ', '0', 1, '0.10', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5930, '6253003130098', 'لبنه حموده دايت 250 جرام', '0', 1, '1.40', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(5931, '6253008989042', 'رز تايجر 3.5كغم', '0', 1, '3.99', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5932, '6256812736413', 'قهوه عيبال 250ج', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5933, '6291003019593', 'اوه بوي بسكوت مينى', '0', 1, '0.05', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5934, '34', 'كمون حب و مطحون حلل', '0', 1, '5.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5935, '6259003057816', 'قطوف حبوب ذره 250غ', '0', 1, '0.60', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5936, '6254000173026', 'مياه الترا 500مل', '0', 1, '0.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5937, '6281076103794', 'مفارش سفرة 44ق', '0', 1, '2.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5938, '6253342504499', 'لبن طيبه بلدى طازج1ك', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5939, '6291003192326', 'كاتشب الحياة850غرام', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5940, '6253502240090', 'كاري', '0', 1, '0.60', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5941, '6291003005992', 'تيفاني ديلايتس بتر كوكيز 80غم', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5942, '5000159500920', 'اكياس ام اند ام', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5943, '547', 'عصا حديد عادي', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5944, '6281100354031', 'بسكوت بسكريم99غ', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5945, '6271002112518', 'حليب كيد دى250مل نكهات', '0', 1, '0.40', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5946, '6281007070744', 'عصير المراعى برتقال مع اللب1.4لتر', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5947, '6253809270158', 'قصدير ارجليه', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5948, '6253502240892', 'بهارات بخاري', '0', 1, '0.70', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5949, '6251098110117', 'الوادى ناجتس دجاج 15قطعه300غ', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5950, '6281060030112', 'بايسن مشروب طاقه 250مل علب', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5951, '6251664001498', 'صابون سائل ريم 500مل نكهات', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5952, '6295120034958', 'فينيش ملح جلايه 2ك1+1عرض', '0', 1, '5.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5953, '5000394011625', 'بطاريات دورسيل', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5954, '8718951288881', 'معجون اسنان جولجيت عده نكهات', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5955, '6291003000782', 'بسكويت نايس عرض', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5956, '7610100300066', 'ماجى شوربه خضار الربيع59غ', '0', 1, '0.90', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5957, '4000196901415', 'كريم جليسوليد 400مل', '0', 1, '4.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5958, '8004350130471', 'معكرونه باستازارا رقم 47', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5959, '6291003164880', 'صابون سافانا زهر', '0', 1, '0.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5960, '6253005380002', 'سنيوره برغر بقرى 450غ', '0', 1, '1.85', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5961, '3046920010603', 'شوكولاتة لواح', '0', 1, '2.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5962, '6253003180055', 'عصير فرح فراولة200مل', '0', 1, '0.10', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5963, '6253502844007', 'كناري صغير24غرام', '0', 1, '0.10', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5964, '6253505810405', 'شيبس تاكو', '0', 1, '1.30', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5965, '6221155025425', 'شامبو صانسيلك اصفر600مل', '0', 1, '3.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5966, '6294003530303', 'نسكافيه غولد دارك روست 200غم.', '0', 1, '5.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5967, '4023103192577', 'فوط مايكروفايبر4قطع ملون', '0', 1, '2.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5968, '6281013247024', 'شاى الربيع اخضر 25 مدليه', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5969, '57060385', 'علكه ستيمرول36قطعه بدون سكر*3', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5970, '56461200664', 'افكو ذره حب185غ', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5971, '6251043000531', 'جلى نون20غ نكهات', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5972, '8001841555553', 'مسحوق تايد5ك', '0', 1, '6.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5973, '6253502244081', 'ميراميه النكهة مدليات', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5974, '8710533006791', 'نقانق دجاج ملعب هولندى400غ', '0', 1, '1.35', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5975, '6281026102600', 'معجون طماطم سعودي كرتون', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5976, '50158973', 'ديتول اخضر 125 جرام', '0', 1, '0.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5977, '22200930086', 'مزيل عرق سبيد ستك رجالي85غرام نكهات', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5978, '6210241010582', 'الدره معجون الطماطم1.375غ', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5979, '6972676190191', 'شدة بيفال0191', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5980, '6253005380194', 'سنيوره لحم بقرى مفروم400غ', '0', 1, '1.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5981, '339', 'منقل شوي جاهز', '0', 1, '2.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5982, '6253005311211', 'سنيورة مرتديلاحبش خضار1كغم', '0', 1, '4.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5983, '8690705336058', 'شوكلاتة بيض فافو', '0', 1, '0.40', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5984, '6253504961535', 'معطرجو', '0', 1, '2.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5985, '6294017108628', 'شوكولاته ماكنتوش اكياس 500غ', '0', 1, '4.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5986, '6253503660156', 'لافينا شومر20كيس', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5987, '17273508010', 'ورق غار', '0', 1, '1.35', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5988, '6251043000890', 'كريمه نون الجاهزه', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5989, '3179732337542', 'مياة بريه', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5990, '8896512367111', 'موبتكس مماسح سحرية 4قطعة', '0', 1, '2.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5991, '6084010580053', 'شيبس ميجا', '0', 1, '0.10', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5992, '6281060102802', 'كاديه جرين اخضر 300مل', '0', 1, '0.60', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5993, '6253006101378', 'جبنه حليبنا دهن 500غ', '0', 1, '3.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5994, '617950600053', 'كاتشب العلالي 585غ .', '0', 1, '1.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5995, '5010511478071', 'مشروم كاندى جوز هند بريطانى120غ', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5996, '8410416003915', 'زيتون شرائح اسود345غ كومارو', '0', 1, '0.85', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5997, '219', 'جبنه مغليه سطل2ك', '0', 1, '8.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(5998, '8801055707249', 'نسكافيه اربيانا 3غ', '0', 1, '0.35', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(5999, '617950410041', 'العلالي مربى التوت', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6000, '6001067004936', 'فرشاه اسنان زقزاق سوفت', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6001, '3011261040107', 'مماسح', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6002, '5352101825736', 'فوستر كلارك بيكنج باودر 110غ', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6003, '717273501447', 'مخلل خيار شرائح امريكان68اونس', '0', 1, '5.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6004, '6251092004139', 'زيت جولدن كورن زرة 1.5ل', '0', 1, '4.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6005, '5287000076852', 'عسل جبل الشيخ425غرام', '0', 1, '3.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6006, '6253001065002', 'سكر ناعم الكسيح350غرام', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6007, '6223000492512', 'توينكز كيك', '0', 1, '0.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6008, '550', 'بهارات مشكله حلل', '0', 1, '5.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6009, '6223000274668', 'شاي ماسالا', '0', 1, '0.30', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6010, '4023103185975', 'فوط فلدا سايكر وفايبر8قطع', '0', 1, '4.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6011, '9556920001425', 'شوفان اوتشوكو400غ', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6012, '6253009211067', 'مسلك مجاري كونتك500جرام', '0', 1, '1.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6013, '6253341500041', 'عصير اليوم فواكه1.7لتر', '0', 1, '2.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6014, '5352101665769', 'فوستر كلارك كربونات صودا150غ', '0', 1, '0.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6015, '8690705128608', 'كيك شوكو دوت', '0', 1, '0.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6016, '5281112023070', 'معطر اقمشة فيرنيل3لترازرق', '0', 1, '3.90', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6017, '5281112023056', 'معطر فيرنيل 3لتر لافندر', '0', 1, '3.90', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6018, '6291113003635', 'اصيل السمن النباتى 500مل', '0', 1, '2.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6019, '6251088083476', 'مخلل خيار', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6020, '6281011136252', 'زيت دلال نخيل17لتر', '0', 1, '27.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6021, '6251088086798', 'نيولاند لانشون بقري850غم', '0', 1, '2.50', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6022, '14', 'فحم الشعلة نباتى شوال4ك', '0', 1, '4.50', '2023-04-11 16:53:41', '2023-04-11 16:59:36'),
(6023, '7622210021502', 'بسكوت اوريو 1*10', '0', 1, '1.75', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6024, '617950143734', 'تونة العلالي', '0', 1, '1.25', '2023-04-11 16:53:41', '2023-04-11 16:53:41'),
(6025, '8693374262802', 'فول حب800جرام', '0', 1, '1.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31'),
(6026, '6210241701800', 'خل تفاح الدره', '0', 1, '555.00', '2023-04-11 16:53:41', '2023-04-11 16:55:31');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `merchants`
--
ALTER TABLE `merchants`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `products_merchant_id_foreign` (`merchant_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `merchants`
--
ALTER TABLE `merchants`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6027;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_merchant_id_foreign` FOREIGN KEY (`merchant_id`) REFERENCES `merchants` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
